# **Integrity Checks**
1. <dl>
  <dt>Domain Integrity</dt>
  <dd>Specifies that all columns in a relational database must be declared upon a defined domain</dd>
- <dl>
  <dt>Entity Integrity</dt>
  <dd>Ensuring that each row of a table has a unique and non-null primary key value</dd>
- <dl>
  <dt>Relational Integrity</dt>
  <dd>If a value of one attribute of a relation references a value of another attribute, then the referenced value must exist</dd>

In [1]:
%load_ext sql
%sql sqlite:///CourseData.db

'Connected: @CourseData.db'

# **Domain Integrity**

### _CATALOGS_

In [2]:
%%sql
SELECT *
FROM CATALOGS
LIMIT 3;

 * sqlite:///CourseData.db
Done.

[(1, 'AN 0301', 'Independent Study', '1-3 Credits', None, None, None, None, 'Students undertake an individualized program of study in consultation with a director from the Asian studies faculty.', 1),
 (2, 'AN 0310', 'Asian Studies Seminar', '3 Credits', None, None, None, None, 'This seminar examines selected topics concerning Asia. This course is taught in conjunction with another 100-300 level course from a rotation of cour ... (412 characters truncated) ... e term paper in substitution of some portion of the conjoined course requirements, as determined by the instructor. Open to juniors and seniors only.', 1),
 (3, 'BU 0211', 'Legal Environment of Business', '3 Credits', 'Junior standing.', None, None, None, 'This course examines the broad philosophical as well as practical nature and function of the legal system, and introduces students to the legal and s ... (171 characters truncated) ... ivil process, and regulatory areas such as employment discrimination, protection of the environment, and corporate governance and securities markets.', 2)]

### _COURSES_

In [3]:
%%sql
SELECT *
FROM COURSES
LIMIT 5;

 * sqlite:///CourseData.db
Done.

[(1, 70384, 'Fall2014', 'C01', 0, 31, -31, "['TF 0800am-0915am 09/02-12/08 DSB 105']", 1, 'AC 0011'),
 (2, 70385, 'Fall2014', 'C02', 0, 31, -31, "['TF 0930am-1045am 09/02-12/08 DSB 105']", 1, 'AC 0011'),
 (3, 70382, 'Fall2014', 'C03', 0, 31, -31, "['TF 1230pm-0145pm 09/02-12/08 DSB 105']", 1, 'AC 0011'),
 (4, 70291, 'Fall2014', 'C04', 0, 29, -29, "['MR 1100am-1215pm 09/02-12/08 DSB 111']", 2, 'AC 0011'),
 (5, 70350, 'Fall2014', 'C05', 0, 30, -30, "['MR 1230pm-0145pm 09/02-12/08 DSB 111']", 2, 'AC 0011')]

### _COURSE MEETINGS_

In [4]:
%%sql
SELECT *
FROM COURSE_MEETINGS
LIMIT 5;

 * sqlite:///CourseData.db
Done.

[(1, 70384, 'Fall2014', 'DSB 105', 'T', '2014-09-02T08:00:00', '2014-09-02T09:15:00'),
 (2, 70384, 'Fall2014', 'DSB 105', 'F', '2014-09-05T08:00:00', '2014-09-05T09:15:00'),
 (3, 70384, 'Fall2014', 'DSB 105', 'T', '2014-09-09T08:00:00', '2014-09-09T09:15:00'),
 (4, 70384, 'Fall2014', 'DSB 105', 'F', '2014-09-12T08:00:00', '2014-09-12T09:15:00'),
 (5, 70384, 'Fall2014', 'DSB 105', 'T', '2014-09-16T08:00:00', '2014-09-16T09:15:00')]

### _PROGRAMS_

In [5]:
%%sql
SELECT *
FROM PROGRAMS
LIMIT 5;

 * sqlite:///CourseData.db
Done.

[(1, 'Asian Studies', 'AN'),
 (2, 'Business', 'BU'),
 (3, 'Black Studies', 'BL'),
 (4, 'Bioengineering', 'BEN'),
 (5, 'Arabic', 'AR')]

### _FACULTY_

In [6]:
%%sql
SELECT *
FROM FACULTY
LIMIT 5;

 * sqlite:///CourseData.db
Done.

[(1, 'Michael P.  Coyne'),
 (2, 'Rebecca I.  Bloch'),
 (3, 'Paul   Caster'),
 (4, 'Jo Ann   Drusbosky'),
 (5, 'Arleen N.  Kardos')]

# **Entity Integrity**

### _CATALOGS_

In [7]:
%%sql
SELECT DISTINCT COUNT(CourseCode), COUNT(CatID), COUNT(CourseCode)
FROM CATALOGS;

 * sqlite:///CourseData.db
Done.

[(2220, 2220, 2220)]

### _COURSES_

In [8]:
%%sql
SELECT DISTINCT COUNT(CRN), COUNT(CID), COUNT(CRN)
FROM COURSES;

 * sqlite:///CourseData.db
Done.

[(15243, 15243, 15243)]

### _COURSE MEETINGS_

In [9]:
%%sql
SELECT DISTINCT COUNT(location), COUNT(CMID), COUNT(location)
FROM COURSE_MEETINGS;

 * sqlite:///CourseData.db
Done.

[(304902, 304902, 304902)]

### _PROGRAMS_

In [10]:
%%sql
SELECT DISTINCT COUNT(program_code), COUNT(PID), COUNT(program_code)
FROM PROGRAMS;

 * sqlite:///CourseData.db
Done.

[(83, 83, 83)]

### _FACULTY_

In [11]:
%%sql
SELECT DISTINCT COUNT(FName), COUNT(FID), COUNT(FName)
FROM FACULTY;

 * sqlite:///CourseData.db
Done.

[(1104, 1104, 1104)]

## Relational Integrity

In [12]:
%%sql

SELECT CourseCode, program_name, CRN, FName, location
FROM CATALOGS
    JOIN PROGRAMS USING (PID)
    JOIN COURSES USING (CourseCode)
    JOIN FACULTY USING (FID)
    JOIN COURSE_MEETINGS USING (CRN)
GROUP BY CRN
ORDER BY program_name
LIMIT 10;

 * sqlite:///CourseData.db
Done.

[('AC 0555', 'Accounting', 10913, 'Dawn W  Massey', 'DSB 115'),
 ('AC 0555', 'Accounting', 11618, 'Dawn W  Massey', 'DSB 104'),
 ('AC 0204', 'Accounting', 31036, 'Milo W.  Peck', 'DSB 110A'),
 ('AC 0204', 'Accounting', 31072, 'Milo W.  Peck', 'DSB 110A'),
 ('AC 0345', 'Accounting', 31090, 'Kathi M.  Mettler', 'DSB 2109A'),
 ('AC 0012', 'Accounting', 31092, 'Rebecca I.  Bloch', 'DSB 108'),
 ('AC 0203', 'Accounting', 31148, 'Rebecca I.  Bloch', 'DSB 104'),
 ('AC 0310', 'Accounting', 31158, 'Lisa Suzanne  Haylon', 'DSB 106'),
 ('AC 0012', 'Accounting', 31177, 'Rebecca I.  Bloch', 'DSB 108'),
 ('AC 0012', 'Accounting', 31194, 'Bruce   Bradford', 'DSB 104')]

## Queries

### How many courses have Dr. Huntley and Dr. Tao taught?

In [18]:
%%sql
SELECT FID,FName, COUNT(DISTINCT CRN) AS NumCourses
FROM FACULTY
    JOIN COURSES USING (FID)
WHERE (FName like '%Huntley%');

 * sqlite:///CourseData.db
Done.

[(275, 'Christopher L.  Huntley', 28)]

In [19]:
%%sql

SELECT FID,FName, COUNT(DISTINCT CRN) AS NumCourses
FROM FACULTY
    JOIN COURSES USING (FID)
WHERE (FName like '%Tao%');

 * sqlite:///CourseData.db
Done.

[(619, 'Jie   Tao', 28)]

### What courses has Dr. Huntley taught the most?

In [20]:
%%sql
SELECT FID, FName,CourseCode, title, COUNT(DISTINCT CRN) as NumTaught
FROM FACULTY
    JOIN COURSES USING (FID)
    JOIN CATALOGS USING (CourseCode)
WHERE (FName like '%Huntley%')
GROUP BY title
ORDER BY NumTaught DESC
LIMIT 4;

 * sqlite:///CourseData.db
Done.

[(275, 'Christopher L.  Huntley', 'OM 0101', 'Operations Management', 7),
 (275, 'Christopher L.  Huntley', 'IS 0240', 'Systems Analysis and Logical Design', 4),
 (275, 'Christopher L.  Huntley', 'IS 0320', 'Systems Design and Implementation', 4),
 (275, 'Christopher L.  Huntley', 'IS 0135', 'Fundamentals of Web Design', 3)]

### What rooms in DSB has Dr. Huntley taught in?

In [41]:
%%sql
SELECT FName, Location
FROM COURSE_MEETINGS
    JOIN COURSES USING (CRN)
    JOIN FACULTY USING (FID)
WHERE (FName like '%Huntley%') and (location like '%DSB%')
GROUP BY location
ORDER BY location;

 * sqlite:///CourseData.db
Done.

[('Christopher L.  Huntley', 'DSB 104'),
 ('Christopher L.  Huntley', 'DSB 106'),
 ('Christopher L.  Huntley', 'DSB 107'),
 ('Christopher L.  Huntley', 'DSB 108'),
 ('Christopher L.  Huntley', 'DSB 109'),
 ('Christopher L.  Huntley', 'DSB 110A'),
 ('Christopher L.  Huntley', 'DSB 110B'),
 ('Christopher L.  Huntley', 'DSB 111'),
 ('Christopher L.  Huntley', 'DSB 112'),
 ('Christopher L.  Huntley', 'DSB 114'),
 ('Christopher L.  Huntley', 'DSB 115'),
 ('Christopher L.  Huntley', 'DSB 2109A')]

## Which programs have the most average students per course?

In [60]:
%%sql
SELECT program_name, AVG(act) AS AvgStudents
FROM PROGRAMS
    JOIN CATALOGS USING (PID)
    JOIN COURSES USING (CourseCode)
    JOIN FACULTY USING (FID)
GROUP BY program_name
HAVING AvgStudents > 15
ORDER BY AvgStudents DESC;

 * sqlite:///CourseData.db
Done.

[('Operations Management', 24.4375),
 ('Applied Ethics', 23.14207650273224),
 ('Marketing', 22.84659090909091),
 ('Religious Studies', 22.261176470588236),
 ('Honors', 21.154929577464788),
 ('Management', 20.857526881720432),
 ('Accounting', 20.62977867203219),
 ('History', 20.319444444444443),
 ('Mathematics', 20.208211143695014),
 ('Health Studies', 20.133333333333333),
 ('Philosophy', 19.962025316455698),
 ('Engineering', 19.88157894736842),
 ('Economics', 19.497435897435896),
 ('Finance', 19.4916864608076),
 ('Information Systems', 19.393617021276597),
 ('Anthropology', 19.10924369747899),
 ('Sociology', 18.637755102040817),
 ('English', 18.023121387283236),
 ('Art History', 17.881720430107528),
 ('Taxation', 17.613636363636363),
 ('Quantitative Analysis', 16.9),
 ('Physics', 16.027397260273972),
 ('Biology', 15.740571428571428),
 ('Nursing', 15.643502432244615),
 ('Computer Science', 15.529411764705882),
 ('Classical Studies', 15.514285714285714),
 ('Latin', 15.38888888888889),
 ('Communication', 15.267241379310345)]